DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BLE_LIB.h
/********************************** (C) COPYRIGHT ******************************
 * File Name         : CH573BLE_LIB.H
 * Author            : WCH
 * Version           : V2.20
 * Date              : 2024/01/02
 * Description       : head file
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/


/******************************************************************************/
#ifndef __CH573BLE_LIB_H
#define __CH573BLE_LIB_H

#ifdef __cplusplus
extern "C"
{
#endif
#include  "stdint.h"

#ifndef int8
typedef int8_t                  int8;
#endif
#ifndef int16
typedef int16_t                 int16;
#endif
#ifndef BOOL
typedef uint8_t                 BOOL;
#endif
#ifndef s8
typedef int8_t                  s8;
#endif
#ifndef s16
typedef int16_t                 s16;
#endif
#ifndef s32
typedef int32_t                 s32;
#endif
#ifndef u8
typedef uint8_t                 u8;
#endif
#ifndef u16
typedef uint16_t                u16;
#endif
#ifndef u32
typedef uint32_t                u32;
#endif
#ifndef u64
typedef uint64_t                u64;
#endif
#ifndef u8C
typedef const uint8_t           u8C;
#endif

#ifndef u8V
typedef uint8_t volatile        u8V;
#endif
#ifndef u32V
typedef uint32_t volatile       u32V;
#endif

#ifndef uint8
typedef uint8_t                 uint8;
#endif
#ifndef uint16
typedef uint16_t                uint16;
#endif
#ifndef uint32
typedef uint32_t                uint32;
#endif

#ifndef TRUE
  #define TRUE                  1
#endif
#ifndef FALSE
  #define FALSE                 0
#endif
#ifndef NULL
  #define NULL                  0
#endif
#ifndef SUCCESS
#define  SUCCESS                0x00
#endif
#ifndef  bStatus_t
typedef uint8_t                 bStatus_t;
#endif
#ifndef  tmosTaskID
typedef uint8_t                 tmosTaskID;
#endif
#ifndef  tmosEvents
typedef uint16_t                tmosEvents;
#endif
#ifndef  tmosTimer
typedef uint32_t                tmosTimer;
#endif
#ifndef  tmosSnvId_t
typedef uint8_t                 tmosSnvId_t;
#endif
#ifndef  tmosSnvLen_t
typedef uint8_t                 tmosSnvLen_t;
#endif

// Define function type that generate a random seed callback
typedef uint32_t (*pfnSrandCB)( void );
// Define function type that switch to idle mode callback
typedef uint32_t (*pfnIdleCB)( uint32_t );
// Define function type that run LSI clock calibration callback
typedef void (*pfnLSICalibrationCB)( void );
// Define function type that get temperature callback
typedef uint16_t (*pfnTempSampleCB)( void );
// Define function type that connect/advertise event complete callback.
typedef void (*pfnEventCB)( uint32_t timeUs );
// Define function type that library status callback.
typedef void (*pfnLibStatusErrorCB)( uint8_t code, uint32_t status );
// Define function type that process event
typedef tmosEvents (*pTaskEventHandlerFn)( tmosTaskID taskID, tmosEvents event );
// Define function type that read flash
typedef uint32_t (*pfnFlashReadCB)( uint32_t addr, uint32_t num, uint32_t *pBuf );
// Define function type that write flash
typedef uint32_t (*pfnFlashWriteCB)( uint32_t addr, uint32_t num, uint32_t *pBuf );
// Define function type that get system clock count
typedef uint32_t (*pfnGetSysClock)( void );

/* BLE library config struct */
typedef struct tag_ble_config
{
    uint32_t MEMAddr;               // library memory start address
    uint16_t MEMLen;                // library memory size
    uint32_t SNVAddr;               // SNV flash start address( if NULL,bonding information will not be saved )
    uint16_t SNVBlock;              // SNV flash block size ( default 256 )
    uint8_t SNVNum;                 // SNV flash block number ( default 1 )
    uint8_t BufMaxLen;              // Maximum length (in octets) of the data portion of each HCI data packet( default 27 )
                                    // ATT_MTU = BufMaxLen-4,Range[23,ATT_MAX_MTU_SIZE]
    uint8_t BufNumber;              // Maximum number of sent and received packages cached by the controller( default 5 )
                                    // Must be greater than the number of connections.
    uint8_t TxNumEvent;             // Maximum number of TX data in a connection event ( default 1 )
    uint8_t TxPower;                // Maximum transmit power level( default LL_TX_POWEER_0_DBM(0dBm) )
    uint8_t WakeUpTime;             // Wake up time value in one RTC count
    uint8_t SelRTCClock;            // system clock select
                                    // bit0-1 00: LSE(32768Hz) 01:LSI(32000Hz) 10:LSI(32768Hz)
                                    // bit7:  1: ble timer(HSE)(must disable sleep)
    uint8_t RxNumEvent;             // Maximum number of RX data in a connection event ( default equal to BufNumber )
    uint8_t MacAddr[6];             // MAC address,little-endian( factory default )
    uint8_t ConnectNumber;          // Connect number,lower two bits are peripheral number,followed by central number
    uint8_t WindowWidening;         // Wait rf start window
    uint8_t WaitWindow;             // Wait event arrive window
    pfnSrandCB srandCB;             // Register a program that generate a random seed
    pfnIdleCB sleepCB;              // Register a program that set idle
    pfnTempSampleCB tsCB;           // Register a program that read the current temperature,determine whether calibration is need
    pfnLSICalibrationCB rcCB;       // Register a program that LSI clock calibration
    pfnLibStatusErrorCB staCB;      // Register a program that library status callback
    pfnFlashReadCB readFlashCB;     // Register a program that read flash
    pfnFlashWriteCB writeFlashCB;   // Register a program that write flash
} bleConfig_t; // Library initialization call BLE_LibInit function

/* BLE pa control config struct */
typedef struct tag_ble_pa_control_config
{
    uint32_t txEnableGPIO;        // tx enable gpio register
    uint32_t txDisableGPIO;       // tx disable gpio register
    uint32_t tx_pin;              // tx pin define
    uint32_t rxEnableGPIO;        // rx enable gpio register
    uint32_t rxDisableGPIO;       // rx disable gpio register
    uint32_t rx_pin;              // tx pin define
} blePaControlConfig_t;

